public class Operation {
    /** knowledge point:
     *  运算符：
     *      比较运算符：
     *          ==
     *          》=
     *         《=
     *         等等
     *      布尔运算符：
     *          &  且
     *          &&  且且   （Java的优化，如果左边的已经是false就不会执行右边）
     *          |  或
     *          ||  或或   （Java的优化，如果左边已经是true就不会执行右边）
     *          !  非
     *      位运算符：(bit)
     *          |
     *          &
     *          ^
     *      位移运算符：
     *          >>(符号位不动)
     *          <<
     *          >>>（符号位动）
     *
     */
}
